In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import acquire 
import prepare

In [3]:
df_iris = sns.load_dataset('iris')
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [74]:
df_iris.shape

(150, 5)

In [75]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [76]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [77]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [4]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [79]:
df_google.shape

(891, 12)

In [80]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [81]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [82]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [83]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [5]:
for col in df_google.columns:
    if df_google[col].dtypes == 'object':
        print(f'{col} has {df_google[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

In [6]:
df_google.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [7]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [9]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [11]:
df_excel = pd.read_excel('train.xlsx')
df_excel.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
df_excel_sample = df_excel.head(100)

In [13]:
df_excel_sample.shape

(100, 12)

In [14]:
df_excel.shape

(891, 12)

In [15]:
df_excel.shape[0]

891

In [16]:
df_excel.shape[1]

12

In [18]:
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [89]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    float64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    float64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    float64
 7   Parch        891 non-null    float64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(7), object(5)
memory usage: 83.7+ KB

In [90]:
list(df_excel.select_dtypes(['object']).columns)

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [20]:
df_excel.select_dtypes(include = 'object').columns.tolist()

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [91]:
df2 = df_excel[df_excel.select_dtypes(['float64']).columns]
df2

     PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1.0       0.0     3.0  22.0    1.0    0.0   7.2500
1            2.0       1.0     1.0  38.0    1.0    0.0  71.2833
2            3.0       1.0     3.0  26.0    0.0    0.0   7.9250
3            4.0       1.0     1.0  35.0    1.0    0.0  53.1000
4            5.0       0.0     3.0  35.0    0.0    0.0   8.0500
..           ...       ...     ...   ...    ...    ...      ...
886        887.0       0.0     2.0  27.0    0.0    0.0  13.0000
887        888.0       1.0     1.0  19.0    0.0    0.0  30.0000
888        889.0       0.0     3.0   NaN    1.0    2.0  23.4500
889        890.0       1.0     1.0  26.0    0.0    0.0  30.0000
890        891.0       0.0     3.0  32.0    0.0    0.0   7.7500

[891 rows x 7 columns]

In [21]:
titanic_stats = df_excel[['Age', 'Fare']].describe().T
titanic_stats

      count       mean        std   min      25%      50%   75%       max
Age   714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
Fare  891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [22]:
titanic_stats['range'] = titanic_stats['max']-titanic_stats['min']
titanic_stats

,count,mean,std,min,25%,50%,75%,max,range
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000,79.5800
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292,512.3292

In [2]:
df = acquire.new_titanic_data()
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [3]:
df = acquire.new_iris_data()
df

   species_id species_name
0           1       setosa
1           2   versicolor
2           3    virginica

In [4]:
df = acquire.new_telco_data()
df

,customer_id,internet_service_type_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id,monthly_charges,total_charges,contract_type_id,paperless_billing
0,0002-ORFBO,1,DSL,Female,0,Yes,Yes,9,Yes,No,...,Yes,2,65.60,593.3,No,2,65.60,593.3,2,Yes
1,0003-MKNFE,1,DSL,Male,0,No,No,9,Yes,Yes,...,No,2,59.90,542.4,No,2,59.90,542.4,1,No
2,0004-TLHLJ,2,Fiber optic,Male,0,No,No,4,Yes,No,...,Yes,1,73.90,280.85,Yes,1,73.90,280.85,1,Yes
3,0011-IGKFF,2,Fiber optic,Male,1,Yes,No,13,Yes,No,...,Yes,1,98.00,1237.85,Yes,1,98.00,1237.85,1,Yes
4,0013-EXCHZ,2,Fiber optic,Female,1,Yes,No,3,Yes,No,...,Yes,2,83.90,267.4,Yes,2,83.90,267.4,1,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9282-IZGQK,2,Fiber optic,Female,0,No,No,1,Yes,Yes,...,Yes,1,85.00,85,Yes,1,85.00,85,1,Yes
7039,9462-MJUAW,1,DSL,Male,0,No,No,4,Yes,Yes,...,No,2,50.40,206.6,Yes,2,50.40,206.6,1,No
7040,9705-ZJBCG,1,DSL,Female,0,Yes,Yes,13,Yes,No,...,No,3,54.15,701.05,No,3,54.15,701.05,2,No
7041,9777-IQHWP,2,Fiber optic,Male,0,Yes,Yes,64,Yes,Yes,...,No,3,93.40,5822.3,No,3,93.40,5822.3,3,No
7042,9809-IMGCQ,2,Fiber optic,Male,1,No,No,22,Yes,Yes,...,Yes,1,96.70,2082.95,Yes,1,96.70,2082.95,1,Yes

In [2]:
df = acquire.get_titanic_data()
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [2]:
df = acquire.get_iris_data()
df

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2
...,...,...,...,...,...,...
145,3,virginica,6.7,3.0,5.2,2.3
146,3,virginica,6.3,2.5,5.0,1.9
147,3,virginica,6.5,3.0,5.2,2.0
148,3,virginica,6.2,3.4,5.4,2.3
149,3,virginica,5.9,3.0,5.1,1.8

In [4]:
df = acquire.get_telco_data()
df.head(5)

,customer_id,internet_service_type_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id,monthly_charges,total_charges,contract_type_id,paperless_billing
0,0002-ORFBO,1,DSL,Female,0,Yes,Yes,9,Yes,No,...,Yes,2,65.6,593.3,No,2,65.6,593.3,2,Yes
1,0003-MKNFE,1,DSL,Male,0,No,No,9,Yes,Yes,...,No,2,59.9,542.4,No,2,59.9,542.4,1,No
2,0004-TLHLJ,2,Fiber optic,Male,0,No,No,4,Yes,No,...,Yes,1,73.9,280.85,Yes,1,73.9,280.85,1,Yes
3,0011-IGKFF,2,Fiber optic,Male,1,Yes,No,13,Yes,No,...,Yes,1,98.0,1237.85,Yes,1,98.0,1237.85,1,Yes
4,0013-EXCHZ,2,Fiber optic,Female,1,Yes,No,3,Yes,No,...,Yes,2,83.9,267.4,Yes,2,83.9,267.4,1,Yes

# Data Preparation

In [8]:
df = acquire.get_iris_data()
df

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2
...,...,...,...,...,...,...
145,3,virginica,6.7,3.0,5.2,2.3
146,3,virginica,6.3,2.5,5.0,1.9
147,3,virginica,6.5,3.0,5.2,2.0
148,3,virginica,6.2,3.4,5.4,2.3
149,3,virginica,5.9,3.0,5.1,1.8

In [4]:
df = df.drop(columns = 'species_id')
df

    species_name  sepal_length  sepal_width  petal_length  petal_width
0         setosa           5.1          3.5           1.4          0.2
1         setosa           4.9          3.0           1.4          0.2
2         setosa           4.7          3.2           1.3          0.2
3         setosa           4.6          3.1           1.5          0.2
4         setosa           5.0          3.6           1.4          0.2
..           ...           ...          ...           ...          ...
145    virginica           6.7          3.0           5.2          2.3
146    virginica           6.3          2.5           5.0          1.9
147    virginica           6.5          3.0           5.2          2.0
148    virginica           6.2          3.4           5.4          2.3
149    virginica           5.9          3.0           5.1          1.8

[150 rows x 5 columns]

In [5]:
df = df.rename(columns= {'species_name':'species'})
df

       species  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2
..         ...           ...          ...           ...          ...
145  virginica           6.7          3.0           5.2          2.3
146  virginica           6.3          2.5           5.0          1.9
147  virginica           6.5          3.0           5.2          2.0
148  virginica           6.2          3.4           5.4          2.3
149  virginica           5.9          3.0           5.1          1.8

[150 rows x 5 columns]

In [6]:
dummy_df = pd.get_dummies(df['species'])
dummy_df

     setosa  versicolor  virginica
0         1           0          0
1         1           0          0
2         1           0          0
3         1           0          0
4         1           0          0
..      ...         ...        ...
145       0           0          1
146       0           0          1
147       0           0          1
148       0           0          1
149       0           0          1

[150 rows x 3 columns]

In [7]:
df=pd.concat([df,dummy_df],axis = 1)
df

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0
...,...,...,...,...,...,...,...,...
145,virginica,6.7,3.0,5.2,2.3,0,0,1
146,virginica,6.3,2.5,5.0,1.9,0,0,1
147,virginica,6.5,3.0,5.2,2.0,0,0,1
148,virginica,6.2,3.4,5.4,2.3,0,0,1
149,virginica,5.9,3.0,5.1,1.8,0,0,1

In [9]:
df = prepare.prep_iris(df)
df

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0
...,...,...,...,...,...,...,...,...
145,virginica,6.7,3.0,5.2,2.3,0,0,1
146,virginica,6.3,2.5,5.0,1.9,0,0,1
147,virginica,6.5,3.0,5.2,2.0,0,0,1
148,virginica,6.2,3.4,5.4,2.3,0,0,1
149,virginica,5.9,3.0,5.1,1.8,0,0,1

In [15]:
df = acquire.get_titanic_data()
df

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [16]:
df = prepare.prep_titanic(df)

In [17]:
df

,passenger_id,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,1,0,7.2500,0,1,0,1
1,1,1,1,1,0,71.2833,0,0,0,0
2,2,1,3,0,0,7.9250,1,0,0,1
3,3,1,1,1,0,53.1000,0,0,0,1
4,4,0,3,0,0,8.0500,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,0,0,13.0000,1,1,0,1
887,887,1,1,0,0,30.0000,1,0,0,1
888,888,0,3,1,2,23.4500,0,0,0,1
889,889,1,1,0,0,30.0000,1,1,0,0
890,890,0,3,0,0,7.7500,1,1,1,0

In [24]:
df = acquire.get_telco_data()
df

,customer_id,internet_service_type_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,payment_type_id.1,monthly_charges.1,total_charges.1,contract_type_id.1,paperless_billing.1
0,0002-ORFBO,1,DSL,Female,0,Yes,Yes,9,Yes,No,...,Yes,2,65.60,593.3,No,2,65.60,593.3,2,Yes
1,0003-MKNFE,1,DSL,Male,0,No,No,9,Yes,Yes,...,No,2,59.90,542.4,No,2,59.90,542.4,1,No
2,0004-TLHLJ,2,Fiber optic,Male,0,No,No,4,Yes,No,...,Yes,1,73.90,280.85,Yes,1,73.90,280.85,1,Yes
3,0011-IGKFF,2,Fiber optic,Male,1,Yes,No,13,Yes,No,...,Yes,1,98.00,1237.85,Yes,1,98.00,1237.85,1,Yes
4,0013-EXCHZ,2,Fiber optic,Female,1,Yes,No,3,Yes,No,...,Yes,2,83.90,267.4,Yes,2,83.90,267.4,1,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9282-IZGQK,2,Fiber optic,Female,0,No,No,1,Yes,Yes,...,Yes,1,85.00,85,Yes,1,85.00,85,1,Yes
7039,9462-MJUAW,1,DSL,Male,0,No,No,4,Yes,Yes,...,No,2,50.40,206.6,Yes,2,50.40,206.6,1,No
7040,9705-ZJBCG,1,DSL,Female,0,Yes,Yes,13,Yes,No,...,No,3,54.15,701.05,No,3,54.15,701.05,2,No
7041,9777-IQHWP,2,Fiber optic,Male,0,Yes,Yes,64,Yes,Yes,...,No,3,93.40,5822.3,No,3,93.40,5822.3,3,No
7042,9809-IMGCQ,2,Fiber optic,Male,1,No,No,22,Yes,Yes,...,Yes,1,96.70,2082.95,Yes,1,96.70,2082.95,1,Yes

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 27 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               7043 non-null   object
 1   internet_service_type_id  7043 non-null   int64
 2   internet_service_type     7043 non-null   object
 3   gender                    7043 non-null   object
 4   senior_citizen            7043 non-null   int64
 5   partner                   7043 non-null   object
 6   dependents                7043 non-null   object
 7   tenure                    7043 non-null   int64
 8   phone_service             7043 non-null   object
 9   multiple_lines            7043 non-null   object
 10  online_security           7043 non-null   object
 11  online_backup             7043 non-null   object
 12  device_protection         7043 non-null   object
 13  tech_support              7043 non-null   object
 14  streaming_tv              7043 non-null   object
 15  streaming_movies          7043 non-null   object
 16  contract_type_id          7043 non-null   int64
 17  paperless_billing         7043 non-null   object
 18  payment_type_id           7043 non-null   int64
 19  monthly_charges           7043 non-null   float64
 20  total_charges             7043 non-null   object
 21  churn                     7043 non-null   object
 22  payment_type_id.1         7043 non-null   int64
 23  monthly_charges.1         7043 non-null   float64
 24  total_charges.1           7043 non-null   object
 25  contract_type_id.1        7043 non-null   int64
 26  paperless_billing.1       7043 non-null   object
dtypes: float64(2), int64(7), object(18)
memory usage: 1.5+ MB

In [7]:
df.duplicated().sum()

0

In [8]:
df.internet_service_type_id.value_counts()

2    3096
1    2421
3    1526
Name: internet_service_type_id, dtype: int64

In [13]:
df.internet_service_type.value_counts()

Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64

In [25]:
df = prepare.prep_telco(df)
df

,customer_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,DSL,Female,0,Yes,Yes,9,Yes,No,No,...,No,Yes,Yes,No,2,Yes,2,65.60,593.3,No
1,0003-MKNFE,DSL,Male,0,No,No,9,Yes,Yes,No,...,No,No,No,Yes,1,No,2,59.90,542.4,No
2,0004-TLHLJ,Fiber optic,Male,0,No,No,4,Yes,No,No,...,Yes,No,No,No,1,Yes,1,73.90,280.85,Yes
3,0011-IGKFF,Fiber optic,Male,1,Yes,No,13,Yes,No,No,...,Yes,No,Yes,Yes,1,Yes,1,98.00,1237.85,Yes
4,0013-EXCHZ,Fiber optic,Female,1,Yes,No,3,Yes,No,No,...,No,Yes,Yes,No,1,Yes,2,83.90,267.4,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9282-IZGQK,Fiber optic,Female,0,No,No,1,Yes,Yes,No,...,No,No,No,Yes,1,Yes,1,85.00,85,Yes
7039,9462-MJUAW,DSL,Male,0,No,No,4,Yes,Yes,No,...,No,No,No,No,1,No,2,50.40,206.6,Yes
7040,9705-ZJBCG,DSL,Female,0,Yes,Yes,13,Yes,No,Yes,...,No,Yes,No,No,2,No,3,54.15,701.05,No
7041,9777-IQHWP,Fiber optic,Male,0,Yes,Yes,64,Yes,Yes,Yes,...,Yes,No,No,Yes,3,No,3,93.40,5822.3,No
7042,9809-IMGCQ,Fiber optic,Male,1,No,No,22,Yes,Yes,No,...,No,No,Yes,Yes,1,Yes,1,96.70,2082.95,Yes

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            7043 non-null   object
 1   internet_service_type  7043 non-null   object
 2   gender                 7043 non-null   object
 3   senior_citizen         7043 non-null   int64
 4   partner                7043 non-null   object
 5   dependents             7043 non-null   object
 6   tenure                 7043 non-null   int64
 7   phone_service          7043 non-null   object
 8   multiple_lines         7043 non-null   object
 9   online_security        7043 non-null   object
 10  online_backup          7043 non-null   object
 11  device_protection      7043 non-null   object
 12  tech_support           7043 non-null   object
 13  streaming_tv           7043 non-null   object
 14  streaming_movies       7043 non-null   object
 15  contract_type_id       7043 non-null   int64
 16  paperless_billing      7043 non-null   object
 17  payment_type_id        7043 non-null   int64
 18  monthly_charges        7043 non-null   float64
 19  total_charges          7043 non-null   object
 20  churn                  7043 non-null   object
dtypes: float64(1), int64(4), object(16)
memory usage: 1.1+ MB

Split your data
- Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.
- Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.
- Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.
- Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [10]:
train, validate, test = prepare.split_iris_data(df)

In [11]:
train.head()

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
70,versicolor,5.9,3.2,4.8,1.8,0,1,0
123,virginica,6.3,2.7,4.9,1.8,0,0,1
87,versicolor,6.3,2.3,4.4,1.3,0,1,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
15,setosa,5.7,4.4,1.5,0.4,1,0,0

In [12]:
train.shape

(90, 8)

In [13]:
validate.shape

(30, 8)

In [14]:
test.shape

(30, 8)

In [18]:
train, validate, test = prepare.split_titanic_data(df)

In [19]:
train.head()

,passenger_id,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
455,455,1,3,0,0,7.8958,1,1,0,0
380,380,1,1,0,0,227.5250,1,0,0,0
492,492,0,1,0,0,30.5000,1,1,0,1
55,55,1,1,0,0,35.5000,1,1,0,1
243,243,0,3,0,0,7.1250,1,1,0,1

In [20]:
train.shape

(534, 10)

In [21]:
validate.shape

(178, 10)

In [22]:
test.shape

(179, 10)

In [26]:
train, validate, test = prepare.split_telco_data(df)

In [27]:
train.head()

,customer_id,internet_service_type,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
5897,9847-HNVGP,None,Male,0,No,No,17,Yes,No,No internet service,...,No internet service,No internet service,No internet service,No internet service,2,No,2,19.95,310.6,No
2438,7570-WELNY,Fiber optic,Female,0,Yes,No,68,Yes,Yes,Yes,...,No,No,No,No,3,Yes,3,84.70,5711.05,No
5960,2568-OIADY,Fiber optic,Female,0,Yes,No,37,Yes,Yes,No,...,Yes,No,Yes,Yes,1,Yes,1,99.50,3762,Yes
6051,9351-LZYGF,DSL,Female,0,Yes,No,42,Yes,Yes,Yes,...,No,Yes,No,No,1,Yes,4,66.40,2727.8,No
785,1142-IHLOO,Fiber optic,Female,0,No,No,51,Yes,No,No,...,No,No,Yes,Yes,2,No,4,87.55,4475.9,No

In [28]:
train.shape

(4225, 21)

In [29]:
validate.shape

(1409, 21)

In [30]:
test.shape

(1409, 21)